ServiceDesk/src/AccumulationRegisters/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтатусыЗаявок</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СостояниеЗаявки</name>
    <type>
      <types>CatalogRef.СостоянияЗаявки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаПользователя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеЗаявкиСтарое</name>
    <type>
      <types>CatalogRef.СостоянияЗаявки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ServiceDesk/src/Catalogs/СостоянияЗаявки/СостоянияЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостоянияЗаявки</name>
  <predefined>
    <items>
      <name>ВОжидании</name>
      <description>В ожидании</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>Закрыта</name>
      <description>Закрыта</description>
    </items>
    <items>
      <name>Зарегистрирована</name>
      <description>Зарегистрирована</description>
    </items>
    <items>
      <name>НаКонтроле</name>
      <description>На контроле</description>
    </items>
    <items>
      <name>НаПроверке</name>
      <description>На проверке</description>
    </items>
    <items>
      <name>НаСогласовании</name>
      <description>На согласовании</description>
    </items>
    <items>
      <name>ОжиданиеОтвета</name>
      <description>Ожидание ответа заказчика</description>
    </items>
    <items>
      <name>ОписаниеПроектногоРешения</name>
      <description>Описание проектного решения</description>
    </items>
    <items>
      <name>Отменена</name>
      <description>Отменена</description>
    </items>
    <items>
      <name>ПереданаКИсполнению</name>
      <description>Передана к исполнению</description>
    </items>
    <items>
      <name>СогласованиеПроектногоРешения1</name>
      <description>Согласование проектного решения</description>
    </items>
    <items>
      <name>СогласованиеПроектногоРешения2</name>
      <description>Согласование проектного решения</description>
    </items>
  </predefined>
  <attributes>
    <name>ИмяУстанавливаемойДаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьЗаполнениеПлановыхПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ServiceDesk/src/HTTPServices/СписокЗадач/Module.bsl
Функция СписокGET(Запрос)
		
	ТабельныйНомер	= Запрос.ПараметрыURL["ТабельныйНомер"];
	Состояние		= Запрос.ПараметрыURL["Состояние"];
	
	Исполнитель	= Справочники.Пользователи.НайтиПоРеквизиту("ТабельныйНомер", ТабельныйНомер);
	
	Если Исполнитель.Пустая() Тогда		
		Ответ = Новый HTTPСервисОтвет(404);				
	Иначе                                   		
		
		Соответствие	= Новый Соответствие;
		Соответствие.Вставить("Submited", Справочники.СостоянияЗаявки.ПереданаКИсполнению);		
		Соответствие.Вставить("InProcess", Справочники.СостоянияЗаявки.ВРаботе);
		Соответствие.Вставить("OnHold", Справочники.СостоянияЗаявки.ВОжидании);
		Соответствие.Вставить("OnTest", Справочники.СостоянияЗаявки.НаПроверке);		
		Соответствие.Вставить("Completed", Справочники.СостоянияЗаявки.Выполнена);
		Соответствие.Вставить("Canceled", Справочники.СостоянияЗаявки.Отменена);
		
		//Ищем задачи по сотруднику
		пЗапрос	= Новый Запрос;
		пЗапрос.Текст	= "ВЫБРАТЬ
		             	  |	СтатусыЗаявокОстатки.Заявка.Номер КАК Номер,
		             	  |	СтатусыЗаявокОстатки.Заявка.Дата КАК Дата,
		             	  |	СтатусыЗаявокОстатки.Заявка.Заказчик КАК Заказчик,
		             	  |	СтатусыЗаявокОстатки.Заявка.ЗадачаКратко КАК Тема,
		             	  |	СтатусыЗаявокОстатки.СостояниеЗаявки КАК СостояниеЗаявки
		             	  |ИЗ
		             	  |	РегистрНакопления.СтатусыЗаявок.Остатки(
		             	  |			,
		             	  |			Исполнитель = &Исполнитель
		             	  |				И СостояниеЗаявки = &СостояниеЗаявки) КАК СтатусыЗаявокОстатки";
						  
		пЗапрос.УстановитьПараметр("Исполнитель", Исполнитель);
		
		Если Состояние = "AllStates" Тогда
			пЗапрос.Текст = СтрЗаменить(пЗапрос.Текст, "И СостояниеЗаявки = &СостояниеЗаявки","");	
		Иначе
			пЗапрос.УстановитьПараметр("СостояниеЗаявки", Соответствие[Состояние]);
		КонецЕсли;
		
		ТЗ	= пЗапрос.Выполнить().Выгрузить();
		
		ЗаписьXML	= Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		ЗаписьXML.ЗаписатьНачалоЭлемента("answer");
		
		Для Каждого СтрокаТЗ Из ТЗ Цикл
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("task");
			
			ЗаписьXML.ЗаписатьАтрибут("number", Строка(СтрокаТЗ.Номер));
			ЗаписьXML.ЗаписатьАтрибут("data", Строка(СтрокаТЗ.Дата));
			ЗаписьXML.ЗаписатьАтрибут("customer", Строка(СтрокаТЗ.Заказчик));
			ЗаписьXML.ЗаписатьАтрибут("subject", Строка(СтрокаТЗ.Тема));
			ЗаписьXML.ЗаписатьАтрибут("State",Строка(СтрокаТЗ.СостояниеЗаявки));
			
			ЗаписьXML.ЗаписатьКонецЭлемента();//task
			
		КонецЦикла; 
		
		ЗаписьXML.ЗаписатьКонецЭлемента();//answer
		XMLСтрока	= ЗаписьXML.Закрыть();
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.УстановитьТелоИзСтроки(XMLСтрока);		
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции
